# FamilyName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NestedFamilyTypeReference..::..FamilyName Property
NestedFamilyTypeReference Class See Also
---
Name of the referenced family
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string FamilyName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyName As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyName {
	String^ get ();
}
```

# See Also
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace